perf/inscripciones/inscripciones.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  phases:
    - duration: 10
      arrivalRate: 7
      name: Pre inicio inscripcion
      maxVusers: 70
    - duration: 60
      arrivalCount: 50
      name: inicio inscripcion
      maxVusers: 120




scenarios:
  - name: "Incribirse a materias"
    flow:
      - get:
          url: "/bbox2"
      - think: 10  # tiempo para seleccionar una carrera
      - get:
          url: "/inscripciones/carrera"
      - loop:
           - get:
               url: "/timeout"
           - think: 15  #tiempo para ver materias en las que esta inscripto
           - get:
               url: "/timeout"
           - think: 70  #tiempo para seleccionar una materia
           - get:
               url: "/bbox2"
        count: 4
      - get:
          url: "/inscripciones/logout"