perf/inscripciones/inscripciones.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/inscripciones'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  phases:
    - duration: 1
      arrivalRate: 1
      name: Un Solo Alumno Inscribiendose
      maxVusers: 1




scenarios:
  - name: "Incribirse a materias"
    flow:
      - get:
          url: "/login"
      - think: 10  # tiempo para seleccionar una carrera
      - get:
          url: "/carrera"
      - loop:
           - get:
               url: "/materias"
           - think: 15  #tiempo para ver materias en las que esta inscripto
           - get:
               url: "/materiasdisponibles"
           - think: 70  #tiempo para seleccionar una materia
           - get:
               url: "/inscribirse"
        count: 4
      - get:
          url: "/logout"