perf/inscripciones/inscripciones.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/inscripciones'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  phases:


    - duration: 10
      arrivalCount: 70
      name: Pico inicial prioridad 1
      maxVusers: 120
    - duration: 50
      arrivalCount: 45
      name: Periodo prioridad 1
      maxVusers: 120
    - duration: 10
      arrivalCount: 5
      name: Finalizacion periodo prioridad 1
      maxVusers: 120
    - duration: 10
      arrivalCount: 80
      name: Pico inicial prioridad 2
      maxVusers: 250 # permitimos solapamiento con prioridad 1
    - duration: 50
      arrivalCount: 45
      name: Periodo prioridad 1
      maxVusers: 250
    - duration: 10
      arrivalCount: 5
      name: Finalizacion periodo prioridad 2
      maxVusers: 250
      
scenarios:
  - name: "Incribirse a materias"
    flow:
      - get:
          url: "/login"
      - think: 10  # tiempo para seleccionar una carrera
      - get:
          url: "/carrera"
      - loop:
           - get:
               url: "/materias"
           - think: 15  #tiempo para ver materias en las que esta inscripto
           - get:
               url: "/materiasdisponibles"
           - think: 70  #tiempo para seleccionar una materia
           - get:
               url: "/inscribirse"
        count: 4
      - get:
          url: "/logout"