perf/inscripciones/inscripciones.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/inscripciones'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  phases:


    - duration: 2
      arrivalRate: 14
      name: pico inicial p1
      maxVusers: 120
    - duration: 8
      arrivalRate: 7
      name: Pre inicio inscripcion p1
      maxVusers: 120
    - duration: 60
      arrivalCount: 50
      name: inicio prioridad 1
      maxVusers: 120
    - duration: 1
      arrivalCount: 30
      name: pico inicial p2
      maxVusers: 150 # permitimos solapamiento con prioridad 1
    - duration: 7
      arrivalRate: 6
      name: Pre inicio inscripcion p2
      maxVusers: 150
    - duration: 60
      arrivalCount: 50
      name: inicio prioridad 2
      maxVusers: 120
      
scenarios:
  - name: "Incribirse a materias"
    flow:
      - get:
          url: "/login"
      - think: 10  # tiempo para seleccionar una carrera
      - get:
          url: "/carrera"
      - loop:
           - get:
               url: "/materias"
           - think: 15  #tiempo para ver materias en las que esta inscripto
           - get:
               url: "/materiasdisponibles"
           - think: 70  #tiempo para seleccionar una materia
           - get:
               url: "/inscribirse"
        count: 4
      - get:
          url: "/logout"